# AlignmentStationLabelStationValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlignmentStationLabelStationValue Property
ParameterTypeId Class See Also
---
"Station Value"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlignmentStationLabelStationValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlignmentStationLabelStationValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlignmentStationLabelStationValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace